In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    "name":['vishal','namrata','ratan'],
    "marks":[90,89,78],
    "city":['pune','katraj','mumbai']
}

In [3]:
df =pd.DataFrame(dict1)

In [4]:
df

      name  marks    city
0   vishal     90    pune
1  namrata     89  katraj
2    ratan     78  mumbai

In [7]:
# df.to_csv('p1.csv')
df.to_csv("p1.csv",index=False)

In [8]:
df.describe()

           marks
count   3.000000
mean   85.666667
std     6.658328
min    78.000000
25%    83.500000
50%    89.000000
75%    89.500000
max    90.000000

In [11]:
df.tail(1)

    name  marks    city
2  ratan     78  mumbai

In [12]:
del df

In [13]:
df=pd.read_csv("p1.csv")

In [14]:
df

      name  marks    city
0   vishal     90    pune
1  namrata     89  katraj
2    ratan     78  mumbai

In [18]:
df['name'][1]

'namrata'

In [21]:
ser= pd.Series(np.random.rand(34))

In [22]:
ser

0     0.613834
1     0.181222
2     0.835114
3     0.097208
4     0.296841
5     0.577444
6     0.414184
7     0.843138
8     0.352996
9     0.678527
10    0.926187
11    0.169693
12    0.784234
13    0.809932
14    0.343505
15    0.772388
16    0.007383
17    0.262407
18    0.266591
19    0.329338
20    0.542920
21    0.248599
22    0.613990
23    0.481206
24    0.495086
25    0.632583
26    0.394205
27    0.614942
28    0.742585
29    0.270056
30    0.781970
31    0.658192
32    0.975730
33    0.924735
dtype: float64